fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноСоздатьУведомление = Ложь;
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		НужноСоздатьУведомление = Истина;
		ТекстСообщения = ТекстСообщения + СтрШаблон("Появилась новая заявка! Специалист: %1. Дата: %2. Время: %3.", ВКМ_Специалист, Формат(ВКМ_ДатаПроведенияРабот, "ДЛФ=D"), Формат(ВКМ_ВремяНачалаРаботПлан, "ДЛФ=В;"));
	Иначе
		СсылкаНаОбъект = ЭтотОбъект.Ссылка;
		СтарыеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, "ВКМ_Специалист, ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРаботПлан");
		
		Если СтарыеДанные.ВКМ_Специалист <> ВКМ_Специалист 
			Или СтарыеДанные.ВКМ_ДатаПроведенияРабот <> ВКМ_ДатаПроведенияРабот 
			Или СтарыеДанные.ВКМ_ВремяНачалаРаботПлан <> ВКМ_ВремяНачалаРаботПлан Тогда
			
			НужноСоздатьУведомление = Истина;
			ТекстСообщения = ТекстСообщения + СтрШаблон("Изменились параметры заявки! Cпециалист: %1. Дата: %2. Время: %3.", Формат(ВКМ_ДатаПроведенияРабот, "ДЛФ=D"), Формат(ВКМ_ВремяНачалаРаботПлан, "ДЛФ=В;"));
		КонецЕсли;
	КонецЕсли;
	
	Если НужноСоздатьУведомление Тогда
		
		НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовоеУведомление.ТекстСообщения = ТекстСообщения;
		НовоеУведомление.Записать();
		
	КонецЕсли;
	
	//ВКМ_Телеграм.ОтправитьУведомлениеВТелеграм();
	
КонецПроцедуры
	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ВКМ_Договор) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не указан договор!");
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВКМ_Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Договор не найден");
		Возврат;
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Нужно выбрать вид договора : Абонентское обслуживание");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора) 
		Или Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("В договоре не указаны дата начала или дата окончания");
			Возврат;
	КонецЕсли;
	
	ДатаДокумента = Дата;
	
	Если ДатаДокумента < ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора 
		Или ДатаДокумента > ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Дата документа выходит за пределы действия договора");
			Возврат;
	КонецЕсли;
	
	СтавкаЧас = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из ВКМ_ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_КоличествоЧасов = СтрокаТЧ.ВКМ_ЧасыКОплатеКлиенту;
		Движение.ВКМ_СуммаКОплате = СтрокаТЧ.ВКМ_ЧасыКОплатеКлиенту * СтавкаЧас;
		
	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
